# 55.  Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt. 
# Фамилия, имя, отчество, номер телефона - данные, которые должны находиться в файле.

# 1. Программа должна выводить данные
# 2. Программа должна сохранять данные в текстовом файле
# 3. Поиск по фамилии

# 1 - Интерфейс
# 2 - работа с файлом
# 3 - алгоритм

# 1 - добавление контакта
# 2 - вывод всех
# 3 - поиск по фамилии
# 4 - выход


# Задача 38: Дополнить телефонный справочник возможностью изменения и удаления данных.
# Пользователь также может ввести фамилию, и Вы должны реализовать функционал для изменения и удаления данных


# Леонова Ольга Николаевна 792(67)379-99-39
# Михайлов Фёдор Маркович 82(1311)137-17-89
# Васильев Тимур Савельевич 59(8550)298-23-76
# Устинова Екатерина Романовна 0(338)398-00-68
# Маркова Александра Михайловна 138(1442)711-95-96
#  Маркова Александра Михайловна 138(1442)711-95-96
# Лазарев Лев Матвеевич 811(53)357-30-69
# Ермолова Яна Александровна 627(32)374-37-03
# Борисов Роберт Константинович 020(56)190-83-15
# Филатов Глеб Константинович 8(55)880-25-45


# from Interface import *
# from WorkWithFile import *

# while True:
#     interface()
#     command = int(input('Введите команду: '))
#     if command==1:
#         person = input('Введите данные пользователя: ')
#         add_person(person)
#     elif command==2:
#         show_all()
#     elif command==3:
#         name = input('Введите элемент(фамилию человека) для поиска: ')
#         search_element(name)
#     # elif command ==4:
#     #     # data_to_edit = input('Введите элемент(фамилию человека) для поиска: ') 
#     #     change(data_to_edit)
#     elif command == 5:
#         break
#     else:
#         print('Ввод некорректен')

    









